{
  "colourscheme": "sss",
  "quote": "Veni, vidi, made Some Spring Stuff",
  "quoteAuthor": "unknown author",
  "projectName": "Some Spring Stuff",
  "imageScr": "projects/SomeSpringStuffLOGO.png",
  "paragraphs": [
    {
      "heading": "Released",
      "content": [
        {
          "text": "Records were lost..."
        }
      ]
    },

    {
      "heading": "What is this project",
      "content": [
        {
          "text": "After attempting to learn basics of web-development myself I felt a need to make a helpful studying tutorial by myself. All the sources that I have used to learn Spring Framework (Java-based backend development framewoork) seemed difficult to use."
        },
        {
          "text": "Some were too confoluted. It took countless hours to grasp the basic understanding of a topic through numerous text and video sources. Others were teaching things that I never came to use - the pieces of knowledge that they were conveing to readers were deattached from the real world. They lacked any visible application."
        },
        {
          "text": "Some Spring Stuff was my attempt to create a guide for people that want to get into web development. The idea was that it would focus on the people that have only understood the basics of Java language."
        },
        {
          "text": "I wanted to create a site that would outline a process of creating a simple Spring project. I would use that to then explain the topics that are used in creating real-world applications."
        },
        {
          "text": "I also thought that as I was a begginer in web development my explanations of the concepts would be more intuitively understandable."
        }
      ]
    },
    {
      "heading": "Technologies used",
      "content": [
        {
          "list": ["HTML", "Pure CSS", "Bootstrap 5", "Node JS", "Heroku"]
        }
      ]
    },

    {
      "heading": "What part of the project I completed",
      "content": [
        {
          "text": "I wrote all of the text for the website. I have spent over 3 months researching and trying to understand the most basic and essential components of the technology. Then I attempted to put every piece of knowledge I gained into a comprehensive guide."
        },
        {
          "text": "After that I began creating a website. I had no understanding how to make one, so I spent 2-3 months attempting my best to make a website using plain HTML and CSS. Was one of the most misserable experiences of my life. Please don't do it. Use more adavnced options."
        }
      ]
    },

    {
      "heading": "How to get a look at this wonderful project",
      "content": [
        {
          "text": " Here is a link (if you dare to see):"
        },
        {
          "listLink": [
            "https://github.com/adtimokhin/washingDisasterSolver&^Link to website"
          ]
        }
      ]
    },

    {
      "heading": "Interesting things I learned doing project",
      "content": [
        {
          "text": "For this project I tried something totally new for me: I tried to teach others how to do things. I am thankful to Some Spring Stuff for a number of reasons. Firstly, it taught me a lot about Sprinng Framework. Many aspects of that technology seemed too obscure when I was making my own code. But after searching for things to make the website a lot has clarified."
        },
        {
          "text": "I also learned that I am not that great of a programming instructor yet. I decided to take a pause in that, get a degree first before teachinng others how to code. That is if I will want to teach. Or if I will want to get a degree, for that matter :-)"
        }
      ]
    }
  ]
}
